   0 | struct b2RayCastInput
   0 |   struct b2Vec2 p1
   0 |     float32 x
   4 |     float32 y
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]

   8 |   struct b2Vec2 p2
   8 |     float32 x
  12 |     float32 y
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]

  16 |   float32 maxFraction
     | [sizeof=20, dsize=20, align=4
     |  nvsize=20, nvalign=4]