   0 | struct b2VelocityConstraintPoint
   0 |   struct b2Vec2 rA
   0 |     float32 x
   4 |     float32 y
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]

   8 |   struct b2Vec2 rB
   8 |     float32 x
  12 |     float32 y
     |   [sizeof=8, dsize=8, align=4
     |    nvsize=8, nvalign=4]

  16 |   float32 normalImpulse
  20 |   float32 tangentImpulse
  24 |   float32 normalMass
  28 |   float32 tangentMass
  32 |   float32 velocityBias
     | [sizeof=36, dsize=36, align=4
     |  nvsize=36, nvalign=4]